ObidjonovM/codes_for_mikrocontrollers/ESP8266_Gas_Sensor/ESP8266_D1_mini_Gas_sensor_M1_V1/src/main.cpp
////////////////////////// EEPROM functions///////////////////////////////////////////////////
byte fieldLen;
char ch;
String readFromEEPROM(int stPos) {
  String result;

  // reading the field length from the memory
  EEPROM.get(stPos, fieldLen);

  // reading the field from the memory
  for (int i = stPos + 1; i <= stPos + fieldLen; i++) {
    EEPROM.get(i, ch);
    result += ch;
  }

  return result;
}

bool writeEEPROM(String txt, int stPos) {
  // save the text length to memory
  byte txtLen = byte(txt.length());
  EEPROM.put(stPos, txtLen);

  // save the text to memeory
  for (int i = 1; i <= txtLen; i++) {
    EEPROM.put(stPos + i, char(txt[i - 1]));
    fidoDelay(10);
  }

  return EEPROM.commitReset();
}

void loadCredentials() {
  EEPROM.begin(MEMORY_SIZE);

  // reading stamp value
  int startPos = OFFSET;
  stamp = readFromEEPROM(startPos);
  if (stamp == STAMP) {
    // reading apLogin value
    startPos += stamp.length() + 1;
    apLogin = readFromEEPROM(startPos);

    // reading measureStamp value
    startPos += apLogin.length() + 1;
    measureStamp = readFromEEPROM(startPos);

    if (measureStamp == MEASURE_STAMP) {
      // reading slaveServer value
      startPos += measureStamp.length() + 1;
      slaveServer = readFromEEPROM(startPos);

      // reading maxGasVal value
      startPos += slaveServer.length() + 1;
      String max_gas_val = readFromEEPROM(startPos);
      maxGasVal = max_gas_val.toFloat();

      // reading measureDelay value
      startPos += max_gas_val.length() + 1;
      String measure_delay = readFromEEPROM(startPos);
      measureDelay = measure_delay.toInt();

      // reading connReistTrails value
      startPos += measure_delay.length() + 1;
      String conn_reist_trails = readFromEEPROM(startPos);
      connReistTrails = conn_reist_trails.toInt();

      // reading buzzDuration value
      startPos += conn_reist_trails.length() + 1;
      String buzz_duration = readFromEEPROM(startPos);
      buzzDuration = buzz_duration.toInt();

      // reading buzzInterval value
      startPos += buzz_duration.length() + 1;
      String buzz_interval = readFromEEPROM(startPos);
      buzzInterval = buzz_interval.toInt();

      // reading R_0 value
      startPos += buzz_interval.length() + 1;
      String r_0 = readFromEEPROM(startPos);
      R_0 = r_0.toInt();

      // reading routerLogin value
      startPos += r_0.length() + 1;
      routerLogin = readFromEEPROM(startPos);
    } else {
      // reading routerLogin value
      routerLogin = readFromEEPROM(startPos);
    }

    // reading routerPass value
    startPos += routerLogin.length() + 1;
    routerPass = readFromEEPROM(startPos);

    if (routerPass == ROUTER_PASS) {
      routerPass = "";
    }

    EEPROM.end();
  } else {
    // assigning default values to authorization variables
    apLogin = AP_LOGIN;

    // writing stamp
    startPos = OFFSET;
    stamp = STAMP;
    writeEEPROM(stamp, startPos);

    // writting apLogin
    startPos += stamp.length() + 1;
    writeEEPROM(apLogin, startPos);

    EEPROM.end();
    ESP.reset();
  }
}

void saveCredentials() {
  EEPROM.begin(MEMORY_SIZE);

  // writting stamp
  int startPos = OFFSET;
  stamp = STAMP;
  writeEEPROM(stamp, startPos);

  // writting apLogin
  startPos += stamp.length() + 1;
  writeEEPROM(apLogin, startPos);

  if (measureStamp == MEASURE_STAMP) {
    // writting measureStamp
    startPos += apLogin.length() + 1;
    writeEEPROM(measureStamp, startPos);

    // writting slaveServer
    startPos += measureStamp.length() + 1;
    writeEEPROM(slaveServer, startPos);

    // writting maxGasVal
    startPos += slaveServer.length() + 1;
    String max_gas_val = String(maxGasVal);
    writeEEPROM(max_gas_val, startPos);

    // writting measureDelay
    startPos += max_gas_val.length() + 1;
    String measure_delay = String(measureDelay);
    writeEEPROM(measure_delay, startPos);

    // writting connReistTrails
    startPos += measure_delay.length() + 1;
    String conn_reist_trails = String(connReistTrails);
    writeEEPROM(conn_reist_trails, startPos);

    // writting buzzDuration
    startPos += conn_reist_trails.length() + 1;
    String buzz_duration = String(buzzDuration);
    writeEEPROM(buzz_duration, startPos);

    // writting buzzInterval
    startPos += buzz_duration.length() + 1;
    String buzz_interval = String(buzzInterval);
    writeEEPROM(buzz_interval, startPos);

    // writting R_0
    startPos += buzz_interval.length() + 1;
    String r_0 = String(R_0);
    writeEEPROM(r_0, startPos);

    // writing routerLogin
    startPos += r_0.length() + 1;
    writeEEPROM(routerLogin, startPos);
  } else {
    // writing routerLogin
    startPos += apLogin.length() + 1;
    writeEEPROM(routerLogin, startPos);
  }

  // writing routerPass
  startPos += routerLogin.length() + 1;
  writeEEPROM(routerPass, startPos);

  EEPROM.end();
}

void setup() {
  pinMode(REL_PIN, OUTPUT);
  pinMode(LED_PIN, OUTPUT);
  pinMode(BTN_PIN, INPUT);
  pinMode(GAS_PIN, INPUT);
  pinMode(SAPS_BTN_PIN, INPUT);
  pinMode(BUZZ_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);
  digitalWrite(REL_PIN, LOW);
  digitalWrite(BUZZ_PIN, LOW);
  fidoDelay(1000);

  WiFi.disconnect();
  fidoDelay(3000);
  WiFi.softAPdisconnect(true);
  fidoDelay(3000);
  loadCredentials();
  fidoDelay(3000);
  WiFi.mode(WIFI_STA);
  WiFi.begin(routerLogin.c_str(), routerPass.c_str());
//  fidoDelay(290000);                                           //5 minut dan keyin qurilma ishga tushadi
}

String replaceASCIICode(String txt) {
  String result;
  unsigned int idx = 0;

  while (idx < txt.length()) {
    if (txt[idx] == '%') {
      String numString = "0x" + String(txt[idx + 1]) + String(txt[idx + 2]);
      char ch = (char)(int)strtol(numString.c_str(), NULL, 16);
      result += ch;
      idx += 3;
    } else if (txt[idx] == '+') {
      result += " ";
      idx += 1;
    }
    else {
      result += txt[idx];
      idx += 1;
    }
  }

  return result;
}

String getFieldValue(String txt, String fieldName) {
  if (txt == "") {
    return "";
  }
  int sp = txt.indexOf(fieldName);
  if (sp == -1) {
    return "";
  }
  int ep = txt.indexOf("&", sp);
  if (ep == -1) {
    return replaceASCIICode(txt.substring(sp + fieldName.length() + 1));
  }
  return replaceASCIICode(txt.substring(sp + fieldName.length() + 1, ep));
}

void handleRouter() {
  String postBody = server.arg("plain");
  if (postBody.length() > 0) {
    routerLogin = getFieldValue(postBody, "ssid");
    routerPass = getFieldValue(postBody, "routerPass");
    if (routerPass == "") {
      routerPass = ROUTER_PASS;
    }
    if (routerLogin != "" && routerPass != "") {
      saveCredentials();
      ESP.reset();
    }
  } else {
    writeScanNetworks();
    server.send(200, "text/html", routerHTML());
  }
}

void startHTTPServer() {
  server.on("/", handleRouter);
  fidoDelay(10);
  server.begin();
}

void setupAccessPoint() {
  bool apActivated = false;
  while (!apActivated) {
    apActivated = WiFi.softAP(apLogin, "", CHANNEL);
    fidoDelay(10);
  }
}

void startAPAndServer() {
  int sapsCounter = 0;

