ObidjonovM/codes_for_mikrocontrollers/ESP8266_Gas_Sensor/ESP8266_D1_mini_Gas_sensor_M1_V1/src/main.cpp
  while (digitalRead(SAPS_BTN_PIN) == HIGH) {
    fidoDelay(1);
    sapsCounter++;
    if (sapsCounter == 4000) {
      break;
    }
  }

  if (sapsCounter == 4000) {
    setupAccessPoint();
    fidoDelay(100);
    startHTTPServer();
    fidoDelay(100);
    while (1) {
      server.handleClient();
    }
  }
}

float getMethanePPM() {
  float a0 = analogRead(GAS_PIN); // get raw reading from sensor
  float v_o = a0 * 5 / 1023; // convert reading to volts
  float R_S = (5 - v_o) * 1000 / v_o; // apply formula for getting RS
  float PPM = pow(R_S / R_0, -2.95) * 1000; //apply formula for getting PPM

  return PPM; // return PPM value to calling function
}

void gasSensorLogic() {
  gasVal = getMethanePPM();
  if (gasOn == true) {
    if (gasVal >= maxGasVal) {
      digitalWrite(REL_PIN, LOW);
      gasOn = false;
      relay = "OFF";
    }
  } else {
    if (digitalRead(BTN_PIN) == HIGH) {
      digitalWrite(REL_PIN, HIGH);
      gasOn = true;
      relay = "ON";
    } else {
      digitalWrite(BUZZ_PIN, HIGH);
      fidoDelay(buzzDuration);
      digitalWrite(BUZZ_PIN, LOW);
      fidoDelay(buzzInterval);
    }
  }
}

String sendRequest(String url, String json) {
  WiFiClient client;
  HTTPClient http;

  if (http.begin(client, url)) {
    http.addHeader("Content-Type", "application/json");
    int httpCode = http.POST(json);

    if (httpCode == HTTP_CODE_OK) {
      return http.getString();
    } else {
      return String(httpCode);
    }
  }
  return "-1";
}

String extractFromJSON(String respContent, String cmd) {
  int st_index = respContent.indexOf(cmd);
  if (st_index == -1) {
    return "";
  }

  st_index += cmd.length() + 1;
  char lastQuoteCmd = respContent[st_index - 1];
  st_index = respContent.indexOf("\"", st_index);
  if (st_index == -1 || String(lastQuoteCmd) != "\"") {
    return "";
  }

  int end_index = respContent.indexOf("\"", st_index + 1);
  if (end_index == -1) {
    return "";
  }

  return respContent.substring(st_index + 1, end_index);
}

void getFromDevice() {
  httpResp = sendRequest(slaveServer + END_POINT, "{\"serial_num\":\"" + SERIAL_NUMBER + "\", \"state\":\"" + relay + "\"," +
                         +" \"gas_val\":\"" + gasVal + "\", \"max_gas_value\":\"" + maxGasVal + "\", \"slave_server\":\"" + slaveServer + "\", \"measurement_delay\":\"" + measureDelay + "\"," +
                         +" \"conn_reist_trails\":\"" + connReistTrails + "\", \"buzz_duration\":\"" + buzzDuration + "\", \"buzz_interval\":\"" + buzzInterval + "\", \"R_0\":\"" + R_0 + "\"}");

  String resetRequested = extractFromJSON(httpResp, "reset_requested");
  String resetTaken = extractFromJSON(httpResp, "reset_taken");

  if (resetRequested == "ON" && resetTaken == "NO") {
    ESP.reset();
  }
}

void deviceSettings(String httpResp) {
  String slave_server = extractFromJSON(httpResp, "slave_server");
  String max_gas_value = extractFromJSON(httpResp, "max_gas_value");
  String measurement_delay = extractFromJSON(httpResp, "measurement_delay");
  String buzz_duration = extractFromJSON(httpResp, "buzz_duration");
  String buzz_interval = extractFromJSON(httpResp, "buzz_interval");
  String conn_reist_trails = extractFromJSON(httpResp, "conn_reist_trails");
  String r_0 = extractFromJSON(httpResp, "r_0");
  if (slave_server != "" && slave_server != slaveServer) {
    slaveServer = slave_server;
  }
  if (max_gas_value != "" && max_gas_value.toFloat() != maxGasVal) {
    maxGasVal = max_gas_value.toFloat();
    mustWriteEEPROM = true;
  }
  if (measurement_delay != "" && measurement_delay.toInt() != measureDelay) {
    measureDelay = measurement_delay.toInt();
    mustWriteEEPROM = true;
  }
  if (buzz_duration != "" && buzz_duration.toInt() != buzzDuration) {
    buzzDuration = buzz_duration.toInt();
    mustWriteEEPROM = true;
  }
  if (buzz_interval != "" && buzz_interval.toInt() != buzzInterval) {
    buzzInterval = buzz_interval.toInt();
    mustWriteEEPROM = true;
  }
  if (conn_reist_trails != "" && conn_reist_trails.toInt() != connReistTrails) {
    connReistTrails = conn_reist_trails.toInt();
    mustWriteEEPROM = true;
  }
  if (r_0 != "" && r_0.toInt() != R_0) {
    R_0 = r_0.toInt();
    mustWriteEEPROM = true;
  }
}

void getDeviceSettings() {
  settingsHttpResp = sendRequest(HIDDEN_SERVER + SETTINGS_END_POINT, "{\"serial_num\":\"" + SERIAL_NUMBER + "\"}");
  deviceSettings(settingsHttpResp);
}

void establishConnection(int numTrails) {
  int trailCounter = 0;
  while (WiFi.status() != WL_CONNECTED) {
    if (trailCounter < numTrails) {
      gasSensorLogic();
      startAPAndServer();
      fidoDelay(1000);
      trailCounter++;
    } else {
      break;
    }
  }
}

void loop() {
  startAPAndServer();
  if (measureStamp == MEASURE_STAMP) {
    gasSensorLogic();
    if (WiFi.status() == WL_CONNECTED) {
      digitalWrite(LED_PIN, HIGH);
      getFromDevice();
      if (!wasConnected) {
        getDeviceSettings();
        if (mustWriteEEPROM) {
          saveCredentials();
          mustWriteEEPROM = false;
          ESP.reset();
        }
        wasConnected = true;
      }
    } else {
      wasConnected = false;
      digitalWrite(LED_PIN, LOW);
      establishConnection(connReistTrails);
    }
    fidoDelay(measureDelay);
  } else {
    if (WiFi.status() == WL_CONNECTED) {
      getDeviceSettings();
      if (mustWriteEEPROM == true) {
        measureStamp = MEASURE_STAMP;
        saveCredentials();
        ESP.reset();
      }
    }
  }
}